app/views/manager/orders/index.html.erb

    <%= link_to "All", manager_orders_path(q: params[:q]), class: "manager-filter-pill #{'manager-filter-pill--active' if params[:status].blank?}" %>
    <% Order.statuses.keys.each do |status| %>
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC

        <%= link_to manager_order_path(order), class: "manager-table__row mgr-table__row" do %>
          <span class="mgr-order-num"><strong><%= order.order_number %></strong></span>
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC

          </span>
          <span><%= order.order_items.sum(&:quantity) %></span>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 5