app/views/manager/orders/show.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 5
---
        <div class="mgr-order-items">
          <% @order.order_items.each do |item| %>