app/controllers/admin/categories_controller.rb

    def index
      @categories = policy_scope(Category).includes(:products).ordered
---
SELECT "products".* FROM "products" WHERE "products"."category_id" IN (9, 10, 11, 12)