app/controllers/admin/managers_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'gauravsingh+manager1@bitcot.com' LIMIT 1
---
    def create
      @manager = User.find_or_initialize_by(email: manager_params[:email].to_s.strip.downcase)