app/controllers/admin/orders_controller.rb

    def index
      @orders = Order.includes(order_items: :product).order(created_at: :desc)
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC

    def set_order
      @order = Order.includes(order_items: :product).find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 19