app/controllers/admin/products_controller.rb

    def index
      @products = policy_scope(Product).includes(:category).order(created_at: :desc)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (10, 12, 11, 9)