app/controllers/admin/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@vitalveggies.in' AND "users"."role" = 0 AND "users"."active" = TRUE LIMIT 1
---
    def create
      user = User.find_by(email: params[:email].to_s.strip.downcase, role: :admin, active: true)