app/controllers/manager/categories_controller.rb

    def index
      @categories = Category.includes(:products).ordered
---
SELECT "products".* FROM "products" WHERE "products"."category_id" IN (9, 10, 11, 12)