app/controllers/manager/inventory_controller.rb

    def index
      @products = Product.includes(:category).order(stock_quantity: :asc, created_at: :desc)
      @products = @products.search_by_name_and_description(params[:q]) if params[:q].present?
      @products = @products.where(category_id: params[:category_id]) if params[:category_id].present?
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (9, 10, 11, 12)
SELECT "products".* FROM "products" WHERE "products"."stock_quantity" BETWEEN 1 AND 5 ORDER BY "products"."stock_quantity" ASC, "products"."created_at" DESC
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 10

    def update
      if @product.update(product_params)
---
UPDATE "products" SET "stock_quantity" = 15, "updated_at" = '2026-04-21 11:19:06.711777' WHERE "products"."id" = 21