app/controllers/manager/orders_controller.rb

    def index
      @orders = Order.includes(order_items: :product).order(created_at: :desc)
      @orders = @orders.where(status: params[:status]) if params[:status].present? && Order.statuses.key?(params[:status])
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC
SELECT "orders".* FROM "orders" WHERE "orders"."status" = 0 ORDER BY "orders"."created_at" DESC

    def set_order
      @order = Order.includes(order_items: :product).find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 5 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = 19