app/controllers/manager/products_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (10, 11, 9, 12)
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 10 LIMIT 1
---
    def index
      @products = policy_scope(Product).includes(:category).order(active: :desc, stock_quantity: :asc, created_at: :desc)
      @products = @products.search_by_name_and_description(params[:q]) if params[:q].present?
      @products = @products.where(category_id: params[:category_id]) if params[:category_id].present?
      @products = @products.where(product_kind: params[:kind]) if params[:kind].present?
      @products = @products.where(active: params[:status] == "active") if params[:status].in?(%w[active hidden])

INSERT INTO "products" ("category_id", "name", "slug", "sku", "description", "ingredients", "price", "stock_quantity", "featured", "organic", "local", "seasonal", "active", "product_kind", "created_at", "updated_at", "image") VALUES (10, 'apple', 'apple', 'FRU-APPLE-5F8BD1', 'Kashmiri apple ', 'Apple', 120.0, 5, FALSE, FALSE, FALSE, FALSE, TRUE, 1, '2026-04-21 11:41:50.423464', '2026-04-21 11:41:50.423464', 'gahyeon-lee-tpc_VsiH1zE-unsplash.jpg') RETURNING "id"
---
    def create
      @product = Product.new(product_params)
      authorize @product

      if @product.save