app/controllers/manager/registrations_controller.rb

    def set_manager
      @manager = User.find_by!(role: :manager, invitation_token: params[:token], active: true)
---
SELECT "users".* FROM "users" WHERE "users"."role" = 1 AND "users"."invitation_token" = 'KHXJPWIyh-bl9HKxwi7OSa4IUeh88etS' AND "users"."active" = TRUE LIMIT 1