app/controllers/manager/sessions_controller.rb

    def create
      user = User.find_by(email: params[:email].to_s.strip.downcase, role: :manager, active: true)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'manager@vitalveggies.in' AND "users"."role" = 1 AND "users"."active" = TRUE LIMIT 1