app/views/admin/orders/index.html.erb

        <div class="portal-table__row">
          <span><%= link_to order.order_number, admin_order_path(order) %> · <%= order.customer_name %></span>
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC