app/views/home/index.html.erb

          <span>In stock</span>
          <strong><%= Product.active.where("stock_quantity > 0").count %></strong>
---
SELECT COUNT(*) FROM "products" WHERE "products"."active" = TRUE AND (stock_quantity > 0)