app/views/orders/show.html.erb

      <h2>Items ordered</h2>
      <% @order.order_items.each do |item| %>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 1