lib/cart.rb

  def products_by_id
    ids = line_items.keys.map(&:to_i)
    Product.where(id: ids).index_by(&:id).stringify_keys
---
SELECT "products".* FROM "products" WHERE "products"."id" IN (4, 11, 10)