app/views/admin/categories/index.html.erb

          <p><%= category.slug %> · Position <%= category.position %></p>
          <p><%= pluralize(category.products.count, "product") %></p>
---
SELECT "products".* FROM "products" WHERE "products"."category_id" IN (9, 10, 11, 12)
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = 9