app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 4 AND "users"."active" = TRUE LIMIT 1
---
  def current_user
    return if session[:user_id].blank?

    @current_user ||= User.find_by(id: session[:user_id], active: true)