app/controllers/articles_controller.rb

  def show
    @article = Article.published.find_by!(slug: params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."published" = TRUE AND "articles"."slug" = 'three-juice-recipes-customers-love-in-summer' ORDER BY "articles"."published_on" DESC, "articles"."created_at" DESC LIMIT 1