app/controllers/carts_controller.rb

  def create
    product = Product.active.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."active" = TRUE AND "products"."id" = 11 LIMIT 1

  def update
    product = Product.active.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."active" = TRUE AND "products"."id" = 10 LIMIT 1