app/controllers/orders_controller.rb

  def payment
    @order = Order.includes(order_items: :product).find(params[:id])

    if !@order.online_gateway?
      redirect_to @order, alert: "This order does not require online payment."
      return
    end

    if @order.paid?
      redirect_to @order, notice: "Payment has already been completed for this order."
      return
    end

    if @order.gateway_order_id.blank?
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 1 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = 11