app/controllers/orders_controller.rb

INSERT INTO "orders" ("order_number", "customer_name", "email", "phone", "address_line1", "address_line2", "city", "state", "postal_code", "notes", "status", "subtotal", "discount_total", "delivery_fee", "total", "payment_method", "payment_status", "delivery_window", "tracking_token", "coupon_code", "created_at", "updated_at", "user_id", "address_id") VALUES ('VVJ-20260420-E1DF1C', 'gaurav1', 'gauravsingh+1@bitcot.com', '08319818423', '5401 Terry St     PO Box 35', '', 'rewa', 'madhya pradesh', '486001', '', 0, 409.0, 0.0, 50.0, 459.0, 'cash_on_delivery', 'pending', '', 'QUWP5RPBG7', NULL, '2026-04-20 12:40:33.519638', '2026-04-20 12:40:33.519638', NULL, NULL) RETURNING "id"
---
      locked_lines = lock_cart_lines
      build_order_items(@order, locked_lines)
      reserve_inventory!(locked_lines)
      @order.save!

SELECT "orders".* FROM "orders" WHERE "orders"."id" = 2 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" IN (11, 12)
---
  def show
    @order = Order.includes(order_items: :product).find(params[:id])

SELECT "orders".* FROM "orders" WHERE (LOWER(order_number) = 'vvj-20260420-9a27db' AND LOWER(email) = '') LIMIT 1
---
  def track
    @order = Order.find_by("LOWER(order_number) = ? AND LOWER(email) = ?", params[:order_number].to_s.downcase, params[:email].to_s.downcase)

SELECT "products".* FROM "products" WHERE "products"."id" = 11 LIMIT 1 FOR UPDATE
---
  def lock_cart_lines
    current_cart.items.map do |item|
      {
        product: Product.lock.find(item.product.id),
        quantity: item.quantity

UPDATE "products" SET "stock_quantity" = 3, "updated_at" = '2026-04-20 05:53:17.011034' WHERE "products"."id" = 11
---
  def decrement_inventory!(lines)
    lines.each do |line|
      line[:product].update!(stock_quantity: line[:product].stock_quantity - line[:quantity])