app/controllers/products_controller.rb

  def index
    @categories = Category.active.ordered
    @products = Product.filtered(filter_params)
    @featured_promotion = Promotion.featured.first
    @available_products_count = Product.active.where("stock_quantity > 0").count
---
SELECT COUNT(*) FROM "products" WHERE "products"."active" = TRUE AND (stock_quantity > 0)

  def show
    @product = Product.active.includes(:category).find_by!(slug: params[:id])
    @review = @product.reviews.new
    @reviews = @product.reviews.approved.limit(8)
    @related_products = Product.active.where(category: @product.category).where.not(id: @product.id).limit(4)
---
SELECT "products".* FROM "products" WHERE "products"."active" = TRUE AND "products"."slug" = 'kitchen-veggie-crate' LIMIT 1
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = 7 AND "reviews"."approved" = TRUE ORDER BY "reviews"."created_at" DESC LIMIT 8
SELECT "products".* FROM "products" WHERE "products"."active" = TRUE AND "products"."category_id" = 3 AND "products"."id" != 7 LIMIT 4