app/views/manager/categories/index.html.erb

    <% @categories.each do |category| %>
      <% active_count = category.products.count(&:active?) %>
---
SELECT "products".* FROM "products" WHERE "products"."category_id" IN (9, 10)