app/views/products/index.html.erb

SELECT "categories".* FROM "categories"
---
        <div class="filter-group">
          <%= form.select :category, options_from_collection_for_select(@categories, :id, :name, params[:category]), { include_blank: "All categories" }, class: "field field--compact" %>